In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
dframe = DataFrame(np.arange(12).reshape(3,4),
                  index = ['NYC', 'LA', 'SF'],
                  columns=['a','b','c','d'])

In [4]:
dframe

     a  b   c   d
NYC  0  1   2   3
LA   4  5   6   7
SF   8  9  10  11

In [5]:
dframe.index.map(str.lower)

array(['nyc', 'la', 'sf'], dtype=object)

In [7]:
dframe.index = dframe.index.map(str.lower)

In [8]:
dframe

     a  b   c   d
nyc  0  1   2   3
la   4  5   6   7
sf   8  9  10  11

In [10]:
dframe.rename(index=str.title, columns=str.lower)

     a  b   c   d
Nyc  0  1   2   3
La   4  5   6   7
Sf   8  9  10  11

In [11]:
dframe.rename(index={'ny':'New York'},
             columns={'a':'ALPHA'})

     ALPHA  b   c   d
nyc      0  1   2   3
la       4  5   6   7
sf       8  9  10  11

In [12]:
dframe.rename(index={'ny':'New York'},
             columns={'a':'ALPHA'}, inplace = True)

In [13]:
dframe

     ALPHA  b   c   d
nyc      0  1   2   3
la       4  5   6   7
sf       8  9  10  11